import java.util.*;
import java.util.function.Predicate;
import java.util.stream.Collectors;
import java.util.stream.Stream;

public class Main {
    public static void main(String[] args) {
        String names =
                "Имена для девочки на букву А:\n" +
                        "Августа\n" +
                        "\n" +
                        "Аврора — латинское: «утренняя заря».\n" +
                        "\n" +
                        "Агата — то же, что и Агафья.\n" +
                        "\n" +
                        "Агафья (Агата) — греческое: «добрая, хорошая».\n" +
                        "\n" +
                        "Аглая — греческое: «блистающая, великолепная».\n" +
                        "\n" +
                        "Агнесса\n" +
                        "\n" +
                        "Агния — латинское: «чистота, непорочность, овечка».\n" +
                        "\n" +
                        "Ада — древнееврейское: «нарядная».\n" +
                        "\n" +
                        "Аделаида — древнегерманское: «благородная, высокородная».\n" +
                        "\n" +
                        "Адель — древнегерманское: «благочестивая, благородная».\n" +
                        "\n" +
                        "Адина — арабское: «праздник, пятничное веселье».\n" +
                        "\n" +
                        "Азиза — арабское: «хранящая Бога».\n" +
                        "\n" +
                        "Аида — арабское: «польза, вознаграждение».\n" +
                        "\n" +
                        "Акулина   \n" +
                        "\n" +
                        "Алевтина — греческое: «благовония, без дурного запаха».\n" +
                        "\n" +
                        "Александра — древнегреческое: «защитница людей», от мужского имени Александр.\n" +
                        "\n" +
                        "Алена\n" +
                        "\n" +
                        "Алина — древнегерманское: «благородная, стойкая».\n" +
                        "\n" +
                        "Алиса — германское: «значимая, весомая, достойная».\n" +
                        "\n" +
                        "Алия — арабское: «возвышенная».\n" +
                        "\n" +
                        "Алла — два происхождения: древнегреческое — «другая», древнегерманское — «стать, благородство».\n" +
                        "\n" +
                        "Альбина — латинское: «белая».\n" +
                        "\n" +
                        "Анастасия — древнегреческое: «воскресающая», от мужского имени Анастас.\n" +
                        "\n" +
                        "Ангелина — древнегреческое: «вестница, ангел».\n" +
                        "\n" +
                        "Анжела, Анжелика — древнегреческое: «ангельская».\n" +
                        "\n" +
                        "Анисия (Анисья)\n" +
                        "\n" +
                        "Анита\n" +
                        "\n" +
                        "Анна — древнееврейское: «миловидная, симпатичная».\n" +
                        "\n" +
                        "Антонина — латинское: «противница»; в Древнем Риме обозначало принадлежность девушки к определенному роду.\n" +
                        "\n" +
                        "Анфиса — древнегреческое: «цветущая».\n" +
                        "\n" +
                        "Ариадна\n" +
                        "\n" +
                        "Арина — русская форма имени Ирина.\n" +
                        "\n" +
                        "Ася — греческое: «воскресающая», произошло от имени Анастасия.\n" +
                        "\n" +
                        "Аэлита — древнегреческое: «воздушная».\n" +
                        "\n" +
                        "Имена для девочки на букву Б:\n" +
                        "Барбара — то же, что и Варвара.\n" +
                        "\n" +
                        "Беатриса (Беата) — латинское: «счастливая».\n" +
                        "\n" +
                        "Белла — латинское: «красавица».\n" +
                        "\n" +
                        "Береслава\n" +
                        "\n" +
                        "Богдана\n" +
                        "\n" +
                        "Божена — другая форма имени Богдана: «данная Богом, божественная».\n" +
                        "\n" +
                        "Борислава\n" +
                        "\n" +
                        "Бронислава\n" +
                        "\n" +
                        "Имена для девочки на букву В:\n" +
                        "Валентина — латинское: «здоровая», от мужского имени Валентин.\n" +
                        "\n" +
                        "Валерия — латинское: «сильная», от мужского имени Валерий. Возникло как римское родовое имя.\n" +
                        "\n" +
                        "Ванда\n" +
                        "\n" +
                        "Варвара — древнегреческое: «чужеземка».\n" +
                        "\n" +
                        "Василиса — древнегреческое: «царица».\n" +
                        "\n" +
                        "Васса — древнегреческое: «пустыня».\n" +
                        "\n" +
                        "Веда — болгарское: «русалка».\n" +
                        "\n" +
                        "Венера\n" +
                        "\n" +
                        "Вера — русское: «вера».\n" +
                        "\n" +
                        "Вероника — древнегреческое: «победоносная, несущая победу».\n" +
                        "\n" +
                        "Виктория — латинское: «победа», от мужского имени Виктор.\n" +
                        "\n" +
                        "Виолетта, Виола, Виоланта — латинское: «фиалка», «фиалочка».\n" +
                        "\n" +
                        "Виргиния (Вирджиния)\n" +
                        "\n" +
                        "Виталина\n" +
                        "\n" +
                        "Виталия\n" +
                        "\n" +
                        "Влада, Владислава — славянское: «владеющая», от мужского имени Влад.\n" +
                        "\n" +
                        "Владлена\n" +
                        "\n" +
                        "Власта — чешское: «родина».\n" +
                        "\n" +
                        "Имена для девочки на букву Г:\n" +
                        "Габриэлла (Габриела)\n" +
                        "\n" +
                        "Галина — греческое: «спокойная, безмятежная».\n" +
                        "\n" +
                        "Гаяне — тюркское: «красавица».\n" +
                        "\n" +
                        "Гелена\n" +
                        "\n" +
                        "Гелла\n" +
                        "\n" +
                        "Генриетта — древнегерманское: «благородная красавица, красивая»\n" +
                        "\n" +
                        "Георгина\n" +
                        "\n" +
                        "Герда — скандинавское: «защитница».\n" +
                        "\n" +
                        "Глафира — древнегреческое: «изящная».\n" +
                        "\n" +
                        "Глория\n" +
                        "\n" +
                        "Грация\n" +
                        "\n" +
                        "Гульнара — арабское: «красивый цветок».\n" +
                        "\n" +
                        "Имена для девочки на букву Д:\n" +
                        "Дайна (Дина) — древнееврейское: «отомщенная».\n" +
                        "\n" +
                        "Дана\n" +
                        "\n" +
                        "Дарина — персидское: «владеющая дарами».\n" +
                        "\n" +
                        "Дарья (Дария) — древнегреческое: «сильная, побеждающая».\n" +
                        "\n" +
                        "Джамиля — арабское: «прекрасная».\n" +
                        "\n" +
                        "Джулия\n" +
                        "\n" +
                        "Джульетта\n" +
                        "\n" +
                        "Диана — латинское имя богини охоты.\n" +
                        "\n" +
                        "Дина\n" +
                        "\n" +
                        "Динара\n" +
                        "\n" +
                        "Домна (Доминика)\n" +
                        "\n" +
                        "Дорофея — древнегреческое: «дар Божий», от мужского имени Дорофей.\n" +
                        "\n" +
                        "Имена для девочки на букву Е:\n" +
                        "Ева — древнееврейское: «живая, сама жизнь», первое женское имя.\n" +
                        "\n" +
                        "Евгения — древнегреческое: «благородная», от мужского имени Евгений.\n" +
                        "\n" +
                        "Евдокия — греческое: «благоволение».\n" +
                        "\n" +
                        "Екатерина — древнегреческое: «чистая, непорочная».\n" +
                        "\n" +
                        "Елена — древнегреческое: «прекрасная, светлая, сияющая».\n" +
                        "\n" +
                        "Елизавета — древнееврейское: «клянусь Богом».\n" +
                        "\n" +
                        "Ефросиния (Ефросинья)\n" +
                        "\n" +
                        "Имена для девочки на букву Ж:\n" +
                        "Жанна — древнееврейское: «милость Божья».\n" +
                        "\n" +
                        "Жозефина\n" +
                        "\n" +
                        "Имена для девочки на букву З:\n" +
                        "Зара — арабское: «золото».\n" +
                        "\n" +
                        "Зарема — тюркское: «алая заря».\n" +
                        "\n" +
                        "Земфира — латинское: «непокорная».\n" +
                        "\n" +
                        "Зинаида — древнегреческое: «принадлежащая Зевсу».\n" +
                        "\n" +
                        "Злата\n" +
                        "\n" +
                        "Зоя — древнегреческое: «жизнь».\n" +
                        "\n" +
                        "Имена для девочки на букву И:\n" +
                        "Ида — древнегреческое: «плодородная».\n" +
                        "\n" +
                        "Изабелла — испанское: «красавица».\n" +
                        "\n" +
                        "Изольда — древнегерманское: «блеск золота».\n" +
                        "\n" +
                        "Илона\n" +
                        "\n" +
                        "Инга — древнескандинавское: «зимняя».\n" +
                        "\n" +
                        "Инесса\n" +
                        "\n" +
                        "Инна — латинское: «бурный поток».\n" +
                        "\n" +
                        "Ирина — древнегреческое: «мир».\n" +
                        "\n" +
                        "Имена для девочки на букву К:\n" +
                        "Карина (Карине) — латинское: «смотрит вперед».\n" +
                        "\n" +
                        "Каролина — германское: «королева, королевская кровь».\n" +
                        "\n" +
                        "Кира (Кириена) — древнегреческое: «госпожа, хозяйка».\n" +
                        "\n" +
                        "Клавдия — латинское: «хромая». В Римской империи было родовым именем.\n" +
                        "\n" +
                        "Кристина (Христина) — греческое: «посвященная Христу», возникло после установления христианства.\n" +
                        "\n" +
                        "Ксения — древнегреческое: «чужестранка, гостья».\n" +
                        "\n" +
                        "Имена для девочки на букву Л:\n" +
                        "Лада — славянское: «милая, ладная».\n" +
                        "\n" +
                        "Лариса — греческое: «чайка».\n" +
                        "\n" +
                        "Лейла — арабское: «ночь».\n" +
                        "\n" +
                        "Лидия — древнегреческое имя для жительницы Лидии.\n" +
                        "\n" +
                        "Лилия\n" +
                        "\n" +
                        "Линда — испанское: «красивая».\n" +
                        "\n" +
                        "Лолита — испанское: «скорбь, печаль».\n" +
                        "\n" +
                        "Любовь — старославянское: «любимая».\n" +
                        "\n" +
                        "Людмила — старославянское: «милая людям».\n" +
                        "\n" +
                        "Имена для девочки на букву М:\n" +
                        "Мавра — древнегреческое: «темная, непрозрачная».\n" +
                        "\n" +
                        "Мадина — арабское: «город».\n" +
                        "\n" +
                        "Майя — два происхождения: в древнегреческой мифологии — «богиня, мать Гермеса»; в индийской религиозной мифологии — «прародительница всего живого, Вселенной».\n" +
                        "\n" +
                        "Мальвина — германское: «слабость, нежность».\n" +
                        "\n" +
                        "Маргарита — латинское: «жемчужина».\n" +
                        "\n" +
                        "Марианна — рассматривают как слияние имен Мария и Анна со значением «морская».\n" +
                        "\n" +
                        "Марина — латинское: «морская».\n" +
                        "\n" +
                        "Мария — древнееврейское: «желанная, печальная».\n" +
                        "\n" +
                        "Марта (Марфа) — арамейское: «наставница, госпожа».\n" +
                        "\n" +
                        "Матрена (Матрона) — латинское: «почетная дама».\n" +
                        "\n" +
                        "Мелания\n" +
                        "\n" +
                        "Мила — славянское: «милая».\n" +
                        "\n" +
                        "Милена (Милана)\n" +
                        "\n" +
                        "Мирослава\n" +
                        "\n" +
                        "Мирра — два источника происхождения: древнееврейское — «миртовое дерево»; в советскую эпоху воспринималось как аббревиатура «мировая революция».\n" +
                        "\n" +
                        "Имена для девочки на букву Н:\n" +
                        "Надежда — славянское: «надежда».\n" +
                        "\n" +
                        "Наиль (Наиля) — тюркское: «дар, подарок».\n" +
                        "\n" +
                        "Наина — древнееврейское: «невинная».\n" +
                        "\n" +
                        "Нана\n" +
                        "\n" +
                        "Наталья (Наталия) — латинское: «родная».\n" +
                        "\n" +
                        "Нелли — древнегреческое: «светлая».\n" +
                        "\n" +
                        "Ника\n" +
                        "\n" +
                        "Нина — греческое, образовано от имени основателя Сирийского государства Ниноса.\n" +
                        "\n" +
                        "Нонна — латинское: «девятая».\n" +
                        "\n" +
                        "Имена для девочки на букву О:\n" +
                        "Оксана — возникло как украинская форма имени Ксения.\n" +
                        "\n" +
                        "Олеся — белорусское: «лесная».\n" +
                        "\n" +
                        "Ольга — древнескандинавское: «священная, святая».\n" +
                        "\n" +
                        "Имена для девочки на букву П:\n" +
                        "Пелагея — древнегреческое: «морская».\n" +
                        "\n" +
                        "Полина — древнегреческое, означает принадлежность богу Аполлону, образовано как краткая форма имени Аполлинария.\n" +
                        "\n" +
                        "Прасковья — греческое имя для обозначения тех, кто родился в пятницу.\n" +
                        "\n" +
                        "Имена для девочки на букву Р:\n" +
                        "Рахиль — древнееврейское: «овечка».\n" +
                        "\n" +
                        "Ребекка (Ревекка) — древнееврейское: «верная, захватывающая в плен».\n" +
                        "\n" +
                        "Регина — латинское: «царица, королева».\n" +
                        "\n" +
                        "Рената — латинское: «возрождающаяся».\n" +
                        "\n" +
                        "Рада — славянское: «веселая, радость».\n" +
                        "\n" +
                        "Раиса — греческое: «легкая».\n" +
                        "\n" +
                        "Регина\n" +
                        "\n" +
                        "Рената\n" +
                        "\n" +
                        "Римма — латинское: «римлянка».\n" +
                        "\n" +
                        "Рита — краткая форма имени Маргарита.\n" +
                        "\n" +
                        "Роза — латинское название цветка роза.\n" +
                        "\n" +
                        "Розалина\n" +
                        "\n" +
                        "Роксана\n" +
                        "\n" +
                        "Ростислава\n" +
                        "\n" +
                        "Руслана\n" +
                        "\n" +
                        "Руфина\n" +
                        "\n" +
                        "Руфь (Рут) — древнееврейское: «подруга».\n" +
                        "\n" +
                        "Имена для девочки на букву С:\n" +
                        "Сабина\n" +
                        "\n" +
                        "Светлана — славянское: «свет, чистота».\n" +
                        "\n" +
                        "Селена (Селина)\n" +
                        "\n" +
                        "Серафима — древнееврейское: «огненный ангел».\n" +
                        "\n" +
                        "Сима\n" +
                        "\n" +
                        "Снежана — болгарское: «снежная».\n" +
                        "\n" +
                        "София (Софья) — древнегреческое: «мудрость».\n" +
                        "\n" +
                        "Станислава\n" +
                        "\n" +
                        "Стелла (Эстелла) — латинское: «звезда».\n" +
                        "\n" +
                        "Стефания (Степанида)\n" +
                        "\n" +
                        "Сусанна (Сосанна, Сузанна, Сюзанна) — древнееврейское название цветка белая лилия.\n" +
                        "\n" +
                        "Имена для девочки на букву Т:\n" +
                        "Таисия — латинское: «плодородная».\n" +
                        "\n" +
                        "Тамара — древнееврейское: «финиковая пальма».\n" +
                        "\n" +
                        "Татьяна — греческое: «устроительница, расставляющая правила».\n" +
                        "\n" +
                        "Тереза\n" +
                        "\n" +
                        "Имена для девочки на букву У:\n" +
                        "Ульяна — второй вариант имени Юлиана.\n" +
                        "\n" +
                        "Устинья (Юстина) — латинское: «справедливая».\n" +
                        "\n" +
                        "Имена для девочки на букву Ф:\n" +
                        "Фаина — древнегреческое: «сияющая».\n" +
                        "\n" +
                        "Фая\n" +
                        "\n" +
                        "Фатима — арабское: «отнятая от груди».\n" +
                        "\n" +
                        "Феврония (Февронья)\n" +
                        "\n" +
                        "Федора (Феодора)\n" +
                        "\n" +
                        "Фелиция\n" +
                        "\n" +
                        "Феодосия (Феодосья)\n" +
                        "\n" +
                        "Фекла\n" +
                        "\n" +
                        "Флора — латинское название цветов или имя римской богини цветов и весны.\n" +
                        "\n" +
                        "Фрида — древнегерманское: «верная».\n" +
                        "\n" +
                        "Имена для девочки на букву Х:\n" +
                        "Харита (Харитина)\n" +
                        "\n" +
                        "Хельга — вариант имени Ольга.\n" +
                        "\n" +
                        "Христина — второй вариант имени Кристина.\n" +
                        "\n" +
                        "Имена для девочки на букву Э:\n" +
                        "\n" +
                        "Эвелина — французское: «лесной орех».\n" +
                        "\n" +
                        "Эдда\n" +
                        "\n" +
                        "Эдита\n" +
                        "\n" +
                        "Элеонора — еврейское: «Бог — мой свет».\n" +
                        "\n" +
                        "Элиза — древнегерманское: «милость Божья».\n" +
                        "\n" +
                        "Элла — древнегерманское: «светлая».\n" +
                        "\n" +
                        "Эллина (Элина)\n" +
                        "\n" +
                        "Эльвира — древнегерманское: «защитница людей».\n" +
                        "\n" +
                        "Эльза — древнегерманское: «неспокойная».\n" +
                        "\n" +
                        "Эмилия\n" +
                        "\n" +
                        "Эмма — древнегерманское: «льстивая».\n" +
                        "\n" +
                        "Эрика\n" +
                        "\n" +
                        "Эстер — древнееврейское: «звезда».\n" +
                        "\n" +
                        "Имена для девочки на букву Ю:\n" +
                        "Юлиана — еще один вариант имени Ульяна.\n" +
                        "\n" +
                        "Юлия — латинское: «кудрявая, пушистая». В Римской империи родовое имя.\n" +
                        "\n" +
                        "Юна (Уна, Юнна) — латинское: «единственная».\n" +
                        "\n" +
                        "Юнона — латинское: «вечно молодая». Так звали римскую богиню — жену Юпитера, покровительницу брака.\n" +
                        "\n" +
                        "Имена для девочки на букву Я:\n" +
                        "Ядвига\n" +
                        "\n" +
                        "Яна (Янина) — древнееврейское: «Богом данная на милость всем».\n" +
                        "\n" +
                        "Янита\n" +
                        "\n" +
                        "Ярослава — славянское: «яркая слава».";

        List<String> words = Arrays.asList(names.split("\n"));
        List<String> wordsWithoutEmpty = words.stream().filter(x -> x.toString().length() > 0).toList();
        wordsWithoutEmpty.forEach(System.out::println);
        System.out.println();
        wordsWithoutEmpty = wordsWithoutEmpty.stream().filter(s -> !s.toString().startsWith("Имена для девочки на букву")).toList();
        wordsWithoutEmpty.forEach(System.out::println);
        System.out.println();
        List<String> sortedNames =
                Stream.concat(wordsWithoutEmpty.stream().filter(x -> x.toString().contains(" ")).map(s -> s.substring(0, s.indexOf(" "))),
                        wordsWithoutEmpty.stream().filter(t -> !t.toString().contains(" "))).sorted().toList();
        sortedNames.forEach(System.out::println);
        System.out.println();
        Predicate<String> pred3letters = new Predicate<String>() {
            @Override
            public boolean test(String s) {
                int count = 0;
                for (Character c:s.toLowerCase().toCharArray()) {
                    if ("аеёиоуыэюя".contains(c.toString())) count++;
                }
                return count == 3;
            }
        };
        Predicate<String> pred4letters = new Predicate<String>() {
            @Override
            public boolean test(String s) {
                int count = 0;
                for (Character c:s.toLowerCase().toCharArray()) {
                    if ("аеёиоуыэюя".contains(c.toString())) count++;
                }
                return count == 4;
            }
        };
        Predicate<String> pred5letters = new Predicate<String>() {
            @Override
            public boolean test(String s) {
                int count = 0;
                for (Character c:s.toLowerCase().toCharArray()) {
                    if ("аеёиоуыэюя".contains(c.toString())) count++;
                }
                return count == 5;
            }
        };
        System.out.println("Ровно три гласные буквы:");
        sortedNames.stream().filter(s -> pred3letters.test(s)).forEach(System.out::println);
        System.out.println();
        System.out.println("Ровно четыре гласные буквы:");
        sortedNames.stream().filter(s -> pred4letters.test(s)).forEach(System.out::println);
        System.out.println();
        System.out.println("Ровно пять гласных букв:");
        sortedNames.stream().filter(s -> pred5letters.test(s)).forEach(System.out::println);
        System.out.println();
        System.out.println("min букв:");
        Optional<String> min = sortedNames.stream().min((s1, s2) -> s1.length() - s2.length());
        min.ifPresent(System.out::println);
        System.out.println();
        System.out.println("max букв:");
        Optional<String> max = sortedNames.stream().max((s1, s2) -> s1.length() - s2.length());
        max.ifPresent(System.out::println);
        System.out.println();
        System.out.println(" первое имя, начинающееся с буквы Е:");
        Optional<String> eName = sortedNames.stream().filter(n -> n.toString().startsWith("Е")).findFirst();
        eName.ifPresent(System.out::println);
        System.out.println();
        Predicate<String> pred = new Predicate<String>() {
            @Override
            public boolean test(String s) {
                int count = 0;
                for (Character c:s.toLowerCase().toCharArray()) {
                    if ("аеёиоуыэюя".contains(c.toString())) count++;
                }
                return count > 0;
            }
        };
        System.out.println("Все ли имена содержат гласные буквы?");
        System.out.println(sortedNames.stream().allMatch(pred));
        System.out.println();
        Map<String, Integer> map = sortedNames.stream().distinct()
                .collect(Collectors.toMap(s -> s.toString(), x -> x.toString().length()));
        for (Map.Entry<String, Integer> entry : map.entrySet()) {
            System.out.println(entry.getKey() + " => " + entry.getValue());
        }
        System.out.println();

        Map<Integer, List<String>> map2 = sortedNames.stream()
                .collect(Collectors.groupingBy(i -> i.toString().length()));

        for (Map.Entry<Integer, List<String>> entry : map2.entrySet()) {
            System.out.println(entry.getKey() + " => " + entry.getValue());
        }
        System.out.println("без использования Stream API");
        // без использования Stream API
        Map<Integer, List<String>> mapClassic = new TreeMap<Integer, List<String>>();
        for (String name : sortedNames) {
            Integer key = name.length();
            if (mapClassic.get(key) == null) {
                mapClassic.put(key, new ArrayList<String>());
            }
            mapClassic.get(key).add(name);
        }
        for (Map.Entry<Integer, List<String>> entry : mapClassic.entrySet()) {
            System.out.println(entry.getKey() + " => " + entry.getValue());
        }

        Predicate<String> predStart = new Predicate<String>() {
            @Override
            public boolean test(String s) {

                Character c = s.toLowerCase().toCharArray()[0];
                if ("аеёиоуыэюя".contains(c.toString())) {
                     return true;
                }

                return false;
            }
        };
        Map<Boolean, List<String>> namesByLetters = sortedNames.stream().distinct().collect(
                Collectors.partitioningBy(p -> predStart.test(p)));

        for (Map.Entry<Boolean, List<String>> entry : namesByLetters.entrySet()) {
            System.out.println(entry.getKey() + " => " + entry.getValue());
        }
    }
}